Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.MoveNext Method
 Moves to the next item in the enumerator.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
True if succeeded to move to the next item.
Implements
IEnumerator.MoveNext()
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace